{
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "alarmist",
    "1": "comparative",
    "2": "defensive",
    "3": "neutral",
    "4": "optimistic",
    "5": "pessimistic"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "alarmist": 0,
    "comparative": 1,
    "defensive": 2,
    "neutral": 3,
    "optimistic": 4,
    "pessimistic": 5
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "tokenizer_class": "BertTokenizer",
  "transformers_version": "4.57.3",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 32000
}
